import stanza

nlp = stanza.Pipeline('fa')

text = """باران آرامی روی پشت‌بام‌های شهر می‌بارید و ناهید با قدم‌های آهسته وارد کوچه‌ی باریک شد. سامان که از قبل منتظرش بود، کنار چراغ خاموش ایستاده بود و با اضطراب به اطراف نگاه می‌کرد. مهدی کمی دورتر، در سایه‌ی دیوار پنهان شده بود و دفترچه‌ی کوچکش را در دست فشار می‌داد. ناهید با صدایی آرام پرسید: «بالاخره چیزی پیدا کردی؟» سامان سری تکان داد و گفت: «فکر می‌کنم جواب همه‌چیز در همین کوچه است.» مهدی جلو آمد و صفحه‌ای از دفترچه‌اش را نشان داد؛ روی آن طرح یک نشان عجیب حک شده بود. ناهید با دقت به نقش نگاه کرد و گفت: «این همان نمادی است که مادربزرگم همیشه از آن می‌ترسید.» سامان قدمی به عقب برداشت و هوای سرد به صورتش خورد. ناگهان صدای سنگینی از ته کوچه پیچید و هر سه لحظه‌ای به هم خیره ماندند. مهدی آرام گفت: «اگر درست فهمیده باشم… الان باید آماده باشیم.» ناهید چترش را محکم گرفت و سه نفر با هم به سمت صدای ناشناس حرکت کردند."""

doc = nlp(text)

names = set()  

for ent in doc.ents:
    if ent.type == 'pers':
    
        name = ent.text.split()[0]
        names.add(name)

print(list(names))
